CFBundleName = "MacUIM";

com.apple.inputmethod.Japanese = "Uim (Japanese)";
com.apple.inputmethod.TradChinese = "Uim (Traditional Chinese)";
com.apple.inputmethod.SimpChinese = "Uim (Simplified Chinese)";
com.apple.inputmethod.Korean = "Uim (Korean)";
com.apple.inputmethod.Roman = "Uim (Direct)";